{'actor': 'Tom Hanks, Tim Allen, Don Rickles, Jim Varney, Wallace Shawn, John Ratzenberger, Annie Potts, John Morris, Erik von Detten, Laurie Metcalf, R. Lee Ermey, Sarah Freeman, Penn Jillette', 'adult': False, 'budget': 30000000, 'characters': 'Woody (voice), Buzz Lightyear (voice), Mr. Potato Head (voice), Slinky Dog (voice), Rex (voice), Hamm (voice), Bo Peep (voice), Andy (voice), Sid (voice), Mrs. Davis (voice), Sergeant (voice), Hannah (voice), TV Announcer (voice)', 'crew': "John Lasseter, Joss Whedon, Andrew Stanton, Joel Cohen, Alec Sokolow, Bonnie Arnold, Ed Catmull, Ralph Guggenheim, Steve Jobs, Lee Unkrich, Ralph Eggleston, Robert Gordon, Mary Helen Leasman, Kim Blanchette, Marilyn McCoppen, Randy Newman, Dale E. Grahn, Robin Cooper, John Lasseter, Pete Docter, Joe Ranft, Patsy Bouge, Norm DeCarlo, Ash Brannon, Randy Newman, Roman Figun, Don Davis, James Flamberg, Mary Beth Smith, Rick Mackay, Susan Bradley, William Reeves, Randy Newman, Andrew Stanton, Pete Docter, Gary Rydstrom, Karen Robert Jackson, Chris Montan, Rich Quade, Michael Berenstein, Colin Brady, Davey Crockett Feiten, Angie Glocka, Rex Grignon, Tom K. Gurney, Jimmy Hayward, Hal T. Hickel, Karen Kiser, Anthony B. LaMolinara, Guionne Leroy, Bud Luckey, Les Major, Glenn McQueen, Mark Oftedal, Jeff Pidgeon, Jeff Pratt, Steve Rabatich, Roger Rose, Steve Segal, Doug Sheppeck, Alan Sperling, Doug Sweetland, David Tart, Ken Willard, Thomas Porter, Mark Thomas Henne, Oren Jacob, Darwyn Peachey, Mitch Prater, Brian M. Rosen, Sharon Calahan, Galyn Susman, William Cone, Shelley Daniels Lekven, Bob Pauley, Bud Luckey, Andrew Stanton, William Cone, Steve Johnson, Dan Haskett, Tom Holloway, Jean Gillmore, Desirée Mourad, Kelly O'Connell, Sonoko Konishi, Ann M. Rockwell, Julie M. McDonald, Robin Lee, Tom Freeman, Ada Cochavi, Dana Mulligan, Deirdre Morrison, Lori Lombardo, Ellen Devine, Lauren Beth Strogoff, Gary Rydstrom, Gary Summers, Tim Holland, Pat Jackson, Tom Myers, J.R. Grubbs, Susan 
Sanford, Susan Popovic, Dan Engstrom, Ruth Lambert, Mickie McGowan", 'genres': 'Animation, Comedy, Family', 'id': 862, 'keywords': 'jealousy, toy, boy, friendship, friends, rivalry, boy next door, new toy, toy comes to life', 'original_language': 'en', 'original_title': 'Toy Story', 'overview': "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.", 'popularity': 21.946943, 'poster_path': '/rhIRbceoE9lR4veEXuwCC2wARtG.jpg', 'production_companies': 'Pixar Animation Studios', 'production_countries': 'United States of America', 'release_date': '1995-10-30', 'revenue': 373554033.0, 'runtime': 81.0, 'score': 7.6419559022, 'spoken_languages': 'English', 'tagline': None, 'title': 'Toy Story', 'vote_average': 7.7, 'vote_count': 5415.0}, {'actor': 'Robin Williams, Jonathan Hyde, Kirsten Dunst, Bradley Pierce, Bonnie Hunt, Bebe Neuwirth, David Alan Grier, Patricia Clarkson, Adam Hann-Byrd, Laura Bell Bundy, James Handy, Gillian Barber, Brandon Obray, Cyrus Thiedeke, Gary Joseph Thorup, Leonard Zola, Lloyd Berry, Malcolm Stewart, Annabel Kershaw, Darryl Henriques, Robyn Driscoll, Peter Bryant, Sarah Gilson, Florica Vlad, June Lion, Brenda Lockmuller', 'adult': False, 'budget': 65000000, 'characters': 'Alan Parrish, Samuel Alan Parrish / Van Pelt, Judy Sheperd, Peter Shepherd, Sarah Whittle, Nora Shepherd, Carl Bentley, Carol Anne Parrish, Alan Parrish (young), Sarah Whittle (young), Exterminator, Mrs. Thomas the Realtor, Benjamin, Caleb, Billy Jessup, Cop, Bum, Jim Shepherd, Martha Shepherd, Gun Salesman, Paramedic, Paramedic, Girl, Girl, Baker, Pianist', 'crew': 'Larry J. Franco, Jonathan Hensleigh, James Horner, Joe Johnston, Robert Dalva, Nancy Foy, Kyle Balda, James D. Bissell, Scott Kroopf, Ted Field, Robert W. Cort, Thomas E. Ackerman, Chris van Allsburg, William Teitler, Greg Taylor, Jim Strain', 'genres': 'Adventure, Fantasy, Family', 'id': 8844, 'keywords': "board game, disappearance, based on children's book, new home, recluse, giant insect", 'original_language': 'en', 'original_title': 'Jumanji', 'overview': "When siblings Judy and Peter discover an enchanted board game that opens the door to a magical world, they unwittingly invite Alan -- an adult who's been trapped inside the game for 26 years -- into their living room. Alan's only hope for freedom is to finish the game, which proves risky as all three find themselves running from giant rhinoceroses, evil 
monkeys and other terrifying creatures.", 'popularity': 17.015539, 'poster_path': '/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg', 'production_companies': 'TriStar Pictures, Teitler Film, Interscope Communications', 'production_countries': 'United States of America', 'release_date': '1995-12-15', 'revenue': 262797249.0, 'runtime': 104.0, 'score': 6.8227077972, 'spoken_languages': 'English, Français', 'tagline': 'Roll the dice and unleash the excitement!', 'title': 'Jumanji', 'vote_average': 6.9, 'vote_count': 2413.0}, {'actor': 'Walter Matthau, Jack Lemmon, Ann-Margret, Sophia Loren, Daryl Hannah, Burgess Meredith, Kevin Pollak', 'adult': False, 'budget': 0, 'characters': 'Max Goldman, John Gustafson, Ariel Gustafson, Maria Sophia Coletta Ragetti, Melanie Gustafson, Grandpa Gustafson, Jacob Goldman', 'crew': 'Howard Deutch, Mark Steven Johnson, Mark Steven Johnson, Jack Keller', 'genres': 'Romance, Comedy', 'id': 15602, 'keywords': 'fishing, best friend, duringcreditsstinger, old men', 'original_language': 'en', 'original_title': 'Grumpier Old Men', 'overview': "A family wedding reignites the ancient 
feud between next-door neighbors and fishing buddies John and Max. Meanwhile, a sultry Italian divorcée opens a restaurant at the local bait shop, alarming the locals who worry she'll scare the fish away. But she's less interested in seafood than she is in cooking up a hot time with Max.", 'popularity': 11.7129, 'poster_path': '/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg', 'production_companies': 'Warner Bros., Lancaster Gate', 'production_countries': 'United States of America', 'release_date': '1995-12-22', 'revenue': 0.0, 'runtime': 101.0, 'score': 5.9509529473, 'spoken_languages': 'English', 'tagline': 'Still Yelling. Still Fighting. Still Ready for Love.', 'title': 'Grumpier Old Men', 'vote_average': 6.5, 'vote_count': 92.0}, {'actor': 'Whitney Houston, Angela Bassett, Loretta Devine, Lela Rochon, Gregory Hines, Dennis Haysbert, Michael Beach, Mykelti Williamson, Lamont Johnson, Wesley Snipes', 'adult': False, 'budget': 16000000, 'characters': "Savannah 'Vannah' Jackson, Bernadine 'Bernie' Harris, Gloria 'Glo' Matthews, Robin Stokes, Marvin King, Kenneth Dawkins, John Harris, Sr., Troy, Joseph, 
James Wheeler", 'crew': 'Forest Whitaker, Ronald Bass, Ronald Bass, Ezra Swerdlow, Deborah Schindler, Terry McMillan, Terry McMillan, Terry McMillan, Kenneth Edmonds, Caron K', 'genres': 'Comedy, Drama, Romance', 'id': 31357, 'keywords': 'based on novel, interracial relationship, single mother, divorce, chick flick', 'original_language': 'en', 'original_title': 'Waiting to Exhale', 'overview': 'Cheated on, mistreated and stepped on, the women are holding their breath, waiting for the elusive "good man" to break a string of less-than-stellar lovers. Friends and confidants Vannah, Bernie, Glo and Robin talk it all out, determined to find a better way to breathe.', 'popularity': 3.859495, 'poster_path': '/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg', 'production_companies': 'Twentieth Century Fox Film Corporation', 'production_countries': 'United States of America', 'release_date': '1995-12-22', 'revenue': 81452156.0, 'runtime': 127.0, 'score': 5.7117701628, 'spoken_languages': 'English', 'tagline': 'Friends are the people who let you be yourself... and never let you forget it.', 'title': 'Waiting to Exhale', 'vote_average': 6.1, 'vote_count': 34.0}, {'actor': 'Steve Martin, Diane Keaton, Martin Short, Kimberly Williams-Paisley, George Newbern, Kieran Culkin, BD Wong, Peter Michael Goetz, Kate McGregor-Stewart, Jane Adams, Eugene Levy, Lori Alan', 'adult': False, 'budget': 0, 'characters': 'George Banks, Nina Banks, Franck Eggelhoffer, Annie Banks-MacKenzie, Bryan MacKenzie, Matty Banks, Howard Weinstein, John MacKenzie, Joanna MacKenzie, Dr. Megan Eisenberg, Mr. Habib, Wife Mrs. Habib', 'crew': 'Alan Silvestri, Elliot Davis, Nancy Meyers, Nancy Meyers, Albert Hackett, Charles Shyer, Adam Bernardi', 'genres': 'Comedy', 'id': 11862, 'keywords': 'baby, midlife crisis, confidence, aging, daughter, mother daughter relationship, pregnancy, contraception, gynecologist', 'original_language': 'en', 'original_title': 'Father of the Bride Part II', 'overview': "Just when George Banks has recovered from his daughter's wedding, he receives the news that she's pregnant ... and that George's wife, Nina, is expecting too. He was planning on selling their home, but that's a plan that -- like George -- 
will have to change with the arrival of both a grandchild and a kid of his own.", 'popularity': 8.387519, 'poster_path': '/e64sOI48hQXyru7naBFyssKFxVd.jpg', 'production_companies': 'Sandollar Productions, Touchstone Pictures', 'production_countries': 'United States of America', 'release_date': '1995-02-10', 'revenue': 76578911.0, 'runtime': 106.0, 'score': 5.6654599724, 'spoken_languages': 'English', 'tagline': "Just When His World Is Back To Normal... He's In For The Surprise Of His Life!", 'title': 'Father of the Bride Part II', 'vote_average': 5.7, 'vote_count': 173.0}, {'actor': "Al Pacino, Robert De Niro, Val Kilmer, Jon Voight, Tom Sizemore, Diane Venora, Amy Brenneman, Ashley Judd, Mykelti Williamson, Natalie Portman, Ted Levine, Tom Noonan, Tone Loc, Hank Azaria, Wes Studi, Dennis Haysbert, Danny Trejo, Henry Rollins, William Fichtner, Kevin Gage, Susan Traylor, Jerry Trimble, Ricky Harris, Jeremy Piven, Xander Berkeley, Begonya Plaza, Rick Avery, Hazelle Goodman, Ray Buktenica, Max Daniels, Vince Deadrick Jr., Steven Ford, Farrah Forke, Patricia Healy, Paul Herman, Cindy Katz, Brian Libby, Dan Martin, Mario Roberts, Thomas Rosales, Jr., Yvonne Zima, Mick Gould, Bud Cort, Viviane Vives, Kim Staunton, Martin Ferrero, Brad Baldridge, Andrew Camuccio, Kenny Endoso, Kimberly Flynn, Niki Harris, Bill McIntosh, Rick Marzan, Terry Miller, Daniel O'Haco, Kai Soremekun, Peter Blackwell, Trevor Coppola, Mary Kircher, Darin Mangan, Robert Miranda, Manny Perry, Iva Franks Singer, Tim Werner, Philip Ettington", 'adult': False, 'budget': 60000000, 'characters': "Lt. Vincent Hanna, Neil McCauley, Chris Shiherlis, Nate, Michael Cheritto, Justine Hanna, Eady, Charlene Shiherlis, Sergeant Drucker, Lauren Gustafson, Bosko, Kelso, Richard Torena, Alan Marciano, Detective Casals, Donald Breedan, Trejo, Hugh Benny, Roger Van Zant, Waingro, Elaine Cheritto, Schwartz, Albert Torena, Dr. Bob, Ralph, Anna Trejo, Armoured Guard, Hooker's Mother, Timmons, Shooter at Drive-in, Driver at Drive-in, Officer Bruce, Claudia, Bosko's Date, Sergeant Heinz, Rachel, Captain Jackson, Harry Dieter, Bank Guard, Armoured Truck Driver, Hostage Girl,
    1st SIS Detective in the hallway (uncredited), Solenko, Restaurant Manager (uncredited), Castilian Woman (uncredited), Lillian, Construction Clerk, Children's Hospital Doctor, Dominick, Bartender, Casals' Date, Marcia Drucker, Armoured Guard, Basketball Player, Children's Hospital Nurse, Detective, Prostitute, Bar Couple (uncredited), Restaurant Patron (uncredited), Police Woman (uncredited), Grocery Store Employee (uncredited), Cusamano (uncredited), Grocery Store Cop (uncredited), Waitress (uncredited), Bank Guard (uncredited), Ellis (uncredited)", 'crew': "Michael Mann, Michael Mann, Art Linson, Michael Mann, Elliot Goldenthal, Dante Spinotti, Pasquale Buba, William Goldenberg, Dov Hoenig, Tom Rolf, Bonnie Timmermann, Neil Spisak, Margie Stone McShirley, Deborah Lynn Scott, Bill Abbott, Per Hallberg, Terry D. Frazee, Paul H. Haines Jr., Neil Krepela, Joel Kramer, Tony Brubaker, Anne H. Ahrens, Darryl M. Athons, Cate Hardman, Jane Brody, Donald Frazee, Oscar Mazzola, Dianne Wager, Anthony Lattanzio, David Le Vey, Leonard Engelman, Ilona Herman, Vera Mitchell, John Caglione Jr., Ken Diaz, Neal J. Anderson, Duncan Burns, Hector C. Gika, Larry Kemp, Lauren Stephens, Gary Jay, James Muro, Frank Connor, Duane Manwiller, Chris Moseley, Frank Dorowsky, Michael Connell, Budd Carr, Matthew Booth, Vicki Hiatt, Thomas R. Bryant, Ray Boniker, Anna Behlmer, Ron Bartlett, 
Chris Jenkins, Andy Nelson, Mark Smith, Daniel O'Haco, Mick Gould, Tim Werner, Pieter Jan Brugge, Gusmano Cesaretti, Arnon Milchan, Christopher Cronyn, Michael Waxman, Alison E. McBryde, Marsha Bozeman, Jeff Wells, Doug Coleman, Philip Rogers, Jimmy Webb", 'genres': 'Action, Crime, Drama, Thriller', 'id': 949, 'keywords': 'robbery, detective, bank, obsession, chase, shooting, thief, honor, murder, suspense, heist, betrayal, money, gang, cat and mouse, criminal mastermind, cult film, ex-con, heist movie, one last job, loner, bank job, neo-noir, gun fight, crime epic', 'original_language': 'en', 'original_title': 'Heat', 'overview': 'Obsessive master thief, Neil McCauley leads a top-notch crew on various insane heists throughout Los Angeles while a mentally unstable detective, Vincent Hanna pursues him without rest. Each man recognizes and respects the ability and the dedication of the other even though they are aware their cat-and-mouse game may end in violence.', 'popularity': 17.924927, 'poster_path': '/zMyfPUelumio3tiDKPffaUpsQTD.jpg', 'production_companies': 'Regency Enterprises, Forward Pass, Warner Bros.', 'production_countries': 'United States of America', 'release_date': '1995-12-15', 'revenue': 187436818.0, 'runtime': 170.0, 'score': 7.5416436488, 'spoken_languages': 'English, Español', 'tagline': 'A Los Angeles Crime Saga', 'title': 'Heat', 'vote_average': 7.7, 'vote_count': 1886.0}, {'actor': 'Harrison Ford, Julia Ormond, Greg Kinnear, Angie Dickinson, Nancy Marchand, John Wood, Richard Crenna, Lauren Holly, Dana Ivey, Fanny Ardant, Patrick Bruel, Paul Giamatti, Miriam Colón, Elizabeth Franz, Valérie Lemercier, Becky Ann Baker, John C. Vennema, Margo Martindale, J. Smith-Cameron, Christine Luneau-Lipton, Michael Dees, Denis Holmes, Jo-Jo Lowe, Ira Wheeler, Philippa Cooper, Ayako Kawahara, François Genty, Guillaume Gallienne, Inés Sastre, Phina Oruche, Andrea Behalikova, Jennifer Herrera, Kristina Kumlin, Eva Linderholm, Carmen Chaplin, Micheline Van de Velde, Joanna Rhodes, Alan Boone, Patrick Forster-Delmas, Kentaro Matsuo, Peter McKernan, Ed Connelly, Ronald L. Schwary, Alvin Lum, Siching Song, Phil Nee, Randy Becker, Susan Browning, Anthony Mondal, Peter Parks, Woodrow Asai, Eric Bruno Borgman, Michael Cline, Christopher Del Gaudio, Philippe Hartmann, Jerry Quinn, Dori Rosenthal', 'adult': False, 'budget': 58000000, 'characters': 'Linus Larrabee, Sabrina Fairchild, David Larrabee, Mrs. Ingrid Tyson, Maude Larrabee, Fairchild, Patrick Tyson, Elizabeth Tyson, Mack, Irene, Louis, Scott, Rosa, Joanna, Martine, Linda, Ron, Nurse, Carol, Ticket Taker, Singer at Larrabee Party, Butler, Red Head, Bartender, Kelly, India, Make-Up Assistant, Assistant, Model, Model, Model, Model, Model, Model, Paris Friend, Paris Friend, Paris Friend, Paris Friend, Paris Friend, Paris Friend, Helicopter Pilot, Gulf Stream Pilot, Sheik, Tyson Butler, Mother in Hospital, Father in Hospital, Trainer, Secretary, Moroccan Waiter, Senator, Japanese Businessman (uncredited), Airport Employee (uncredited), Head Butler (uncredited), Businessman in Window (uncredited), Wedding Guest (uncredited), Pizza Patron (uncredited), Ballroom Dancer (uncredited)', 'crew': 'Sydney Pollack, Barbara Benedek, Sydney Pollack, John Williams, Fredric Steinkamp, Scott Rudin, David Rubin, Brian Morris, David Rayfiel, Peter Robb-King, Bernadette Mazur, Joseph A. Campayno, Lynda Gurasich, Stephen G. Bishop, Gary Jones, Ann Roth, George DeTitta Jr., Amy Marshall, Miriam Schapiro, Danny Michael, Adam Jenkins, Chris Jenkins, Scott Millan, Myron Nettinga, Mitch Gettleman, Joe Earle, J. Paul Huntsman, Andrew Schmetterling, Adam Sawelson, Barbara Issak, Benjamin Beardwood, Mary A. Kelly, Myles Aronowitz, Brian Hamill, Giovanni Fiore Coltellacci, Giuseppe Rotunno, Kate Dowd, Juliet Polcsa, Michelle Matland, Donna Maloney, Karl F. Steinkamp, Lindsay Doran, Ronald L. Schwary, John Kasarda, Jean-Pierre Avice, Thomas A. Imperato, Ronald L. Schwary, Bill Kaufman, Ronna Kress, Sandrine Ageorges, Joseph E. Iberti, Joanny Carpentier, Katherine Kennedy', 'genres': 'Comedy, Romance', 'id': 11860, 'keywords': 'paris, brother brother relationship, chauffeur, long island, fusion, millionaire', 'original_language': 'en', 'original_title': 'Sabrina', 'overview': 'An ugly duckling having undergone a remarkable change, still harbors feelings for her crush: a carefree playboy, but not before his business-focused brother has something to say about it.', 'popularity': 6.677277, 'poster_path': '/jQh15y5YB7bWz1NtffNZmRw0s9D.jpg', 'production_companies': 'Paramount Pictures, Scott Rudin Productions, Mirage Enterprises, Sandollar 
Productions, Constellation Entertainment, Worldwide, Mont Blanc Entertainment GmbH', 'production_countries': 'Germany, United States of America', 'release_date': '1995-12-15', 'revenue': 0.0, 'runtime': 127.0, 'score': 5.8991122254, 'spoken_languages': 'Français, English', 'tagline': 'You are cordially invited to the most surprising merger of the year.', 'title': 'Sabrina', 'vote_average': 6.2, 'vote_count': 141.0
},
{'actor': 'Jonathan Taylor Thomas, Brad Renfro, Rachael Leigh Cook, Michael McShane, Amy Wright, Eric Schweig, Tamara Mello', 'adult': False, 'budget': 0, 'characters': 'Tom Sawyer, Huck Finn, Becky Thatcher, Muff Potter, Aunt Polly, Injun Joe, Townsperson', 'crew': 'David Loughery, Stephen Sommers, Peter Hewitt, Mark Twain', 'genres': 'Action, Adventure, Drama, Family', 'id': 45325, 'keywords': None, 'original_language': 'en', 'original_title': 'Tom and Huck', 'overview': 'A mischievous young boy, Tom Sawyer, witnesses a murder by the deadly Injun Joe. Tom becomes friends with Huckleberry Finn, a boy with no future and no family. Tom has to choose between honoring a friendship or honoring an oath because the town alcoholic is accused of the murder. Tom and Huck go through several adventures trying to retrieve evidence.', 'popularity': 2.561161, 'poster_path': '/sGO5Qa55p7wTu7FJcX4H4xIVKvS.jpg', 'production_companies': 'Walt Disney Pictures', 'production_countries': 'United States of America', 'release_date': '1995-12-22', 'revenue': 0.0, 'runtime': 97.0, 'score': 5.5763001539, 'spoken_languages': 'English, Deutsch', 'tagline': 'The Original Bad Boys.', 'title': 'Tom and Huck', 'vote_average': 5.4, 'vote_count': 45.0
},
{'actor': 'Jean-Claude Van Damme, Powers Boothe, Dorian Harewood, Raymond J. Barry, Ross Malinger, Whittni Wright', 'adult': False, 'budget': 35000000, 'characters': 'Darren Francis Thomas McCord, Joshua Foss, Matthew Hallmark, Vizepräsident Daniel Bender, Tyler, Emily McCord', 'crew': 'Peter Hyams, Karen Elise Baldwin, Gene Quintano, Moshe Diamant, Anders P. Jensen, Howard Baldwin, John Debney, Peter Hyams, Steven Kemper', 'genres': 'Action, Adventure, Thriller', 'id': 9091, 'keywords': 'terrorist, hostage, explosive, vice president', 'original_language': 'en', 'original_title': 'Sudden Death', 'overview': "International action superstar Jean Claude Van Damme teams with Powers Boothe in a Tension-packed, suspense thriller, set against the back-drop of a Stanley Cup game.Van Damme portrays a father whose daughter is suddenly taken during a championship hockey game. With the captors demanding a billion dollars by game's end, Van Damme frantically sets a plan in motion to rescue his daughter and abort an impending explosion before the final buzzer...", 'popularity': 5.23158, 'poster_path': '/eoWvKD60lT95Ss1MYNgVExpo5iU.jpg', 'production_companies': 'Universal Pictures, Imperial Entertainment, Signature Entertainment', 'production_countries': 'United States of America', 'release_date': '1995-12-22', 'revenue': 64350171.0, 'runtime': 106.0, 'score': 5.5601100937, 'spoken_languages': 'English', 'tagline': 'Terror goes into overtime.', 'title': 'Sudden Death', 'vote_average': 5.5, 'vote_count': 174.0
},
{'actor': 'Pierce Brosnan, Sean Bean, Izabella Scorupco, Famke Janssen, Joe Don Baker, Judi Dench, Gottfried John, Robbie Coltrane, Alan Cumming, Tchéky Karyo, Desmond Llewelyn, Samantha Bond, Michael Kitchen, Serena Gordon, Simon Kunz, Billy J. Mitchell, Constantine Gregory, Minnie Driver, Michelle Arthur, Ravil Isyanov', 'adult': False, 'budget': 58000000, 'characters': 'James Bond, Alec Trevelyan, Natalya Fyodorovna Simonova, Xenia Onatopp, Jack Wade, M, General Arkady Grigorovich Ourumov, Valentin Dmitrovich Zukovsky, Boris Grishenko, Defense Minister Dmitri Mishkin, Q, Miss Moneypenny, Bill Tanner, Caroline, Severnaya Duty Officer, Admiral Chuck Farrell, Computer Store Manager, Irina, Anna, Mig Pilot', 'crew': 'Martin Campbell, Ian Fleming, Jeffrey Caine, Bruce Feirstein, Barbara Broccoli, Tom Pevsner, Eric Serra, Tina Turner, Phil Meheux, Terry Rawlings, Debbie McWilliams, Peter Lamont, Andrew Ackland-Snow, Kathrin Brunner, Charles Dwight Lee, Michael Ford, Lindy Hemming, Michael G. Wilson, Anthony Waye, Michael France, Michael Boone, Steven Lawrence, Tony Graysmark, Neil Lamont, Pam Dixon, Robert Hathaway, Charles Bodycomb, June Randall, Harvey Harrison, Roger Pearce, Herbert Raditschnig, Tim Wooster, Keith Hamshere, George Whitear, Bill Pochetty, Luigi Bisioli, Steve Foster, Chris Corbould, Mara Bryan, Tim Grover, Peter Musgrave, Michael A. Carter, Graham V. Hartstone, John Hayward, Jim Shields, David John', 'genres': 'Adventure, Action, Thriller', 'id': 710, 'keywords': 'cuba, falsely accused, secret identity, computer virus, secret base, secret intelligence service, kgb, satellite, special car, cossack, electromagnetic pulse, time bomb, st. petersburg russia, ejection seat, red army', 'original_language': 'en', 'original_title': 'GoldenEye', 'overview': 'James Bond must unmask the mysterious head of the Janus Syndicate and prevent the leader from utilizing the GoldenEye weapons system to inflict devastating revenge on Britain.', 'popularity': 14.686036, 'poster_path': '/5c0ovjT41KnYIHYuF4AWsTe3sKh.jpg', 'production_companies': 'United Artists, Eon Productions', 'production_countries': 'United Kingdom, United States of America', 'release_date': '1995-11-16', 'revenue': 352194034.0, 'runtime': 130.0, 'score': 6.4875824674, 'spoken_languages': 'English, Pусский, Español', 'tagline': 'No limits. No fears. No substitutes.', 'title': 'GoldenEye', 'vote_average': 6.6, 'vote_count': 1194.0
}